In [1]:
import pandas as pd

In [3]:
df = pd.read_csv("AgentLogingReport.csv")

In [5]:
df.dtypes

SL No           int64
Agent          object
Date           object
Login Time     object
Logout Time    object
Duration       object
dtype: object

In [6]:
df[['Agent','Login Time']]

                  Agent Login Time
0    Shivananda Sonwane   15:35:29
1        Khushboo Priya   15:06:59
2         Nandani Gupta   15:04:24
3       Hrisikesh Neogi   14:34:29
4                Mukesh   14:03:15
..                  ...        ...
995        Manjunatha A   09:03:51
996             Bharath   09:00:49
997      Khushboo Priya   08:59:20
998        Nishtha Jain   08:43:55
999               Tarun   01:52:47

[1000 rows x 2 columns]

In [7]:
type(df['Agent'])

pandas.core.series.Series

In [8]:
type(df[['Agent']])

pandas.core.frame.DataFrame

In [9]:
df.describe()

             SL No
count  1000.000000
mean    500.500000
std     288.819436
min       1.000000
25%     250.750000
50%     500.500000
75%     750.250000
max    1000.000000

In [10]:
df.dtypes == 'object'

SL No          False
Agent           True
Date            True
Login Time      True
Logout Time     True
Duration        True
dtype: bool

In [12]:
df.dtypes[df.dtypes == 'object']

Agent          object
Date           object
Login Time     object
Logout Time    object
Duration       object
dtype: object

In [17]:
type(df.dtypes[df.dtypes == 'object'])

pandas.core.series.Series

In [13]:
df.dtypes[df.dtypes == 'object'].index

Index(['Agent', 'Date', 'Login Time', 'Logout Time', 'Duration'], dtype='object')

In [14]:
type(df.dtypes[df.dtypes == 'object'].index)

pandas.core.indexes.base.Index

In [15]:
df[df.dtypes[df.dtypes == 'object'].index]

                  Agent       Date Login Time Logout Time   Duration
0    Shivananda Sonwane  30-Jul-22   15:35:29    17:39:39   02:04:10
1        Khushboo Priya  30-Jul-22   15:06:59    15:07:16   00:00:17
2         Nandani Gupta  30-Jul-22   15:04:24    17:31:07   02:26:42
3       Hrisikesh Neogi  30-Jul-22   14:34:29    15:19:35   00:45:06
4                Mukesh  30-Jul-22   14:03:15    15:11:52   01:08:36
..                  ...        ...        ...         ...        ...
995        Manjunatha A  20-Jul-22   09:03:51    15:02:28   05:58:37
996             Bharath  20-Jul-22   09:00:49    15:01:32   06:00:43
997      Khushboo Priya  20-Jul-22   08:59:20    14:26:55   05:27:34
998        Nishtha Jain  20-Jul-22   08:43:55    14:00:33   05:16:38
999               Tarun  01-Jul-22   01:52:47    12:01:07  514:08:20

[1000 rows x 5 columns]

In [16]:
df[df.dtypes[df.dtypes == 'object']]

KeyError: "None of [Index([object, object, object, object, object], dtype='object')] are in the [columns]"

In [18]:
df[df.dtypes[df.dtypes == 'object'].index].describe()

            Agent       Date Login Time Logout Time  Duration
count        1000       1000       1000        1000      1000
unique         49         12        957         983       727
top     Dibyanshu  22-Jul-22   15:02:35    21:02:03  00:02:00
freq          208        138          4           3       150

In [23]:
df[df.dtypes[df.dtypes=='int64'].index]

     SL No
0        1
1        2
2        3
3        4
4        5
..     ...
995    996
996    997
997    998
998    999
999   1000

[1000 rows x 1 columns]

In [25]:
df['SL No'][1:4]

1    2
2    3
3    4
Name: SL No, dtype: int64

In [26]:
df['SL No'][1:40:2]

1      2
3      4
5      6
7      8
9     10
11    12
13    14
15    16
17    18
19    20
21    22
23    24
25    26
27    28
29    30
31    32
33    34
35    36
37    38
39    40
Name: SL No, dtype: int64

In [37]:
df[1:40:2]['SL No']

1      2
3      4
5      6
7      8
9     10
11    12
13    14
15    16
17    18
19    20
21    22
23    24
25    26
27    28
29    30
31    32
33    34
35    36
37    38
39    40
Name: SL No, dtype: int64

In [27]:
df.columns

Index(['SL No', 'Agent', 'Date', 'Login Time', 'Logout Time', 'Duration'], dtype='object')

In [28]:
df['Category1']='Steve'

In [29]:
df.columns

Index(['SL No', 'Agent', 'Date', 'Login Time', 'Logout Time', 'Duration',
       'Category1'],
      dtype='object')

In [30]:
df['Agent'].isnull()

0      False
1      False
2      False
3      False
4      False
       ...
995    False
996    False
997    False
998    False
999    False
Name: Agent, Length: 1000, dtype: bool

In [31]:
dfDress = pd.read_excel("../drive-download-20220804T135158Z-001/Dress Sales.xlsx")

In [32]:
dfDress.columns

Index([         'Dress_ID',         '29/8/2013',         '31/8/2013',
       2013-02-09 00:00:00, 2013-04-09 00:00:00, 2013-06-09 00:00:00,
       2013-08-09 00:00:00, 2013-10-09 00:00:00, 2013-12-09 00:00:00,
               '14/9/2013',         '16/9/2013',         '18/9/2013',
               '20/9/2013',         '22/9/2013',         '24/9/2013',
               '26/9/2013',         '28/9/2013',         '30/9/2013',
       2013-02-10 00:00:00, 2013-04-10 00:00:00, 2013-06-10 00:00:00,
       2010-08-10 00:00:00, 2013-10-10 00:00:00, 2013-12-10 00:00:00],
      dtype='object')

In [33]:
dfDress.head(2)

,Dress_ID,29/8/2013,31/8/2013,2013-02-09 00:00:00,2013-04-09 00:00:00,2013-06-09 00:00:00,2013-08-09 00:00:00,2013-10-09 00:00:00,2013-12-09 00:00:00,14/9/2013,...,24/9/2013,26/9/2013,28/9/2013,30/9/2013,2013-02-10 00:00:00,2013-04-10 00:00:00,2013-06-10 00:00:00,2010-08-10 00:00:00,2013-10-10 00:00:00,2013-12-10 00:00:00
0,1006032852,2114,2274,2491,2660,2727,2887,2930,3119,3204,...,3554,3624.0,3706,3746.0,3795.0,3832.0,3897,3923.0,3985.0,4048
1,1212192089,151,275,570,750,813,1066,1164,1558,1756,...,2710,2942.0,3258,3354.0,3475.0,3654.0,3911,4024.0,4125.0,4277

In [36]:
dfDress['30/9/2013'].isnull()

0      False
1      False
2      False
3      False
4      False
       ...
495    False
496    False
497    False
498    False
499    False
Name: 30/9/2013, Length: 500, dtype: bool

In [39]:
df.dtypes

SL No           int64
Agent          object
Date           object
Login Time     object
Logout Time    object
Duration       object
Category1      object
dtype: object

In [41]:
date = pd.to_datetime(df['Date'])

In [44]:
type(date[0])

pandas._libs.tslibs.timestamps.Timestamp

In [45]:
df['converted_Date'] = date

In [46]:
df.columns

Index(['SL No', 'Agent', 'Date', 'Login Time', 'Logout Time', 'Duration',
       'Category1', 'converted_Date'],
      dtype='object')

In [52]:
df['converted_year']=df['converted_Date'].dt.year

In [53]:
df['converted_day']=df['converted_Date'].dt.day

In [55]:
df['converted_month']=df['converted_Date'].dt.month

In [54]:
df['converted_day']

0      30
1      30
2      30
3      30
4      30
       ..
995    20
996    20
997    20
998    20
999     1
Name: converted_day, Length: 1000, dtype: int64

In [51]:
df['converted_day'].value_counts()

2022    1000
Name: converted_day, dtype: int64

In [56]:
df.columns

Index(['SL No', 'Agent', 'Date', 'Login Time', 'Logout Time', 'Duration',
       'Category1', 'converted_Date', 'converted_day', 'converted_year',
       'converted_month'],
      dtype='object')

In [59]:
df[df.dtypes[df.dtypes=='object'].index].describe()

            Agent       Date Login Time Logout Time  Duration Category1
count        1000       1000       1000        1000      1000      1000
unique         49         12        957         983       727         1
top     Dibyanshu  22-Jul-22   15:02:35    21:02:03  00:02:00     Steve
freq          208        138          4           3       150      1000

In [60]:
df[['Agent','converted_day']].value_counts()

Agent         converted_day
Dibyanshu     29               41
              22               39
              27               36
              20               25
              28               24
                               ..
Aditya_iot    20                1
Manjunatha A  25                1
              27                1
              28                1
Zeeshan       29                1
Length: 337, dtype: int64

In [63]:
df.drop('Category1',axis=1)

,SL No,Agent,Date,Login Time,Logout Time,Duration,converted_Date,converted_day,converted_year,converted_month
0,1,Shivananda Sonwane,30-Jul-22,15:35:29,17:39:39,02:04:10,2022-07-30,30,2022,7
1,2,Khushboo Priya,30-Jul-22,15:06:59,15:07:16,00:00:17,2022-07-30,30,2022,7
2,3,Nandani Gupta,30-Jul-22,15:04:24,17:31:07,02:26:42,2022-07-30,30,2022,7
3,4,Hrisikesh Neogi,30-Jul-22,14:34:29,15:19:35,00:45:06,2022-07-30,30,2022,7
4,5,Mukesh,30-Jul-22,14:03:15,15:11:52,01:08:36,2022-07-30,30,2022,7
...,...,...,...,...,...,...,...,...,...,...
995,996,Manjunatha A,20-Jul-22,09:03:51,15:02:28,05:58:37,2022-07-20,20,2022,7
996,997,Bharath,20-Jul-22,09:00:49,15:01:32,06:00:43,2022-07-20,20,2022,7
997,998,Khushboo Priya,20-Jul-22,08:59:20,14:26:55,05:27:34,2022-07-20,20,2022,7
998,999,Nishtha Jain,20-Jul-22,08:43:55,14:00:33,05:16:38,2022-07-20,20,2022,7
999,1000,Tarun,01-Jul-22,01:52:47,12:01:07,514:08:20,2022-07-01,1,2022,7

In [64]:
df.columns

Index(['SL No', 'Agent', 'Date', 'Login Time', 'Logout Time', 'Duration',
       'Category1', 'converted_Date', 'converted_day', 'converted_year',
       'converted_month'],
      dtype='object')

In [65]:
df = df.drop('Category1',axis=1)

In [66]:
df.columns

Index(['SL No', 'Agent', 'Date', 'Login Time', 'Logout Time', 'Duration',
       'converted_Date', 'converted_day', 'converted_year', 'converted_month'],
      dtype='object')

In [68]:
df[1:3]

,SL No,Agent,Date,Login Time,Logout Time,Duration,converted_Date,converted_day,converted_year,converted_month
1,2,Khushboo Priya,30-Jul-22,15:06:59,15:07:16,00:00:17,2022-07-30,30,2022,7
2,3,Nandani Gupta,30-Jul-22,15:04:24,17:31:07,02:26:42,2022-07-30,30,2022,7

In [80]:
df = df.drop(1)

In [81]:
df.loc[[1,2]]

KeyError: '[1] not in index'

In [83]:
df[0:3]

,SL No,Agent,Date,Login Time,Logout Time,Duration,converted_Date,converted_day,converted_year,converted_month
0,1,Shivananda Sonwane,30-Jul-22,15:35:29,17:39:39,02:04:10,2022-07-30,30,2022,7
2,3,Nandani Gupta,30-Jul-22,15:04:24,17:31:07,02:26:42,2022-07-30,30,2022,7
3,4,Hrisikesh Neogi,30-Jul-22,14:34:29,15:19:35,00:45:06,2022-07-30,30,2022,7

In [84]:
df.loc[1:9]

,SL No,Agent,Date,Login Time,Logout Time,Duration,converted_Date,converted_day,converted_year,converted_month
2,3,Nandani Gupta,30-Jul-22,15:04:24,17:31:07,02:26:42,2022-07-30,30,2022,7
3,4,Hrisikesh Neogi,30-Jul-22,14:34:29,15:19:35,00:45:06,2022-07-30,30,2022,7
4,5,Mukesh,30-Jul-22,14:03:15,15:11:52,01:08:36,2022-07-30,30,2022,7
5,6,Sowmiya Sivakumar,30-Jul-22,14:03:11,15:05:37,01:02:26,2022-07-30,30,2022,7
6,7,Manjunatha A,30-Jul-22,14:00:12,15:08:29,01:08:16,2022-07-30,30,2022,7
7,8,Harikrishnan Shaji,30-Jul-22,13:53:05,16:06:49,02:13:43,2022-07-30,30,2022,7
8,9,Suraj S Bilgi,30-Jul-22,13:50:01,15:11:42,01:21:41,2022-07-30,30,2022,7
9,10,Shivan K,30-Jul-22,13:28:18,13:59:00,00:30:42,2022-07-30,30,2022,7

In [85]:
df[0:4][['SL No','Agent','Date']]

   SL No               Agent       Date
0      1  Shivananda Sonwane  30-Jul-22
2      3       Nandani Gupta  30-Jul-22
3      4     Hrisikesh Neogi  30-Jul-22
4      5              Mukesh  30-Jul-22

In [86]:
df[['SL No','Agent','Date']][0:4]

   SL No               Agent       Date
0      1  Shivananda Sonwane  30-Jul-22
2      3       Nandani Gupta  30-Jul-22
3      4     Hrisikesh Neogi  30-Jul-22
4      5              Mukesh  30-Jul-22

In [87]:
df.loc[0:4,['SL No','Agent','Date']]

   SL No               Agent       Date
0      1  Shivananda Sonwane  30-Jul-22
2      3       Nandani Gupta  30-Jul-22
3      4     Hrisikesh Neogi  30-Jul-22
4      5              Mukesh  30-Jul-22

In [88]:
df.iloc[0:4,0:3]

   SL No               Agent       Date
0      1  Shivananda Sonwane  30-Jul-22
2      3       Nandani Gupta  30-Jul-22
3      4     Hrisikesh Neogi  30-Jul-22
4      5              Mukesh  30-Jul-22

In [89]:
df.iloc[0:4]

,SL No,Agent,Date,Login Time,Logout Time,Duration,converted_Date,converted_day,converted_year,converted_month
0,1,Shivananda Sonwane,30-Jul-22,15:35:29,17:39:39,02:04:10,2022-07-30,30,2022,7
2,3,Nandani Gupta,30-Jul-22,15:04:24,17:31:07,02:26:42,2022-07-30,30,2022,7
3,4,Hrisikesh Neogi,30-Jul-22,14:34:29,15:19:35,00:45:06,2022-07-30,30,2022,7
4,5,Mukesh,30-Jul-22,14:03:15,15:11:52,01:08:36,2022-07-30,30,2022,7

In [90]:
df.iloc[[1,2]]

,SL No,Agent,Date,Login Time,Logout Time,Duration,converted_Date,converted_day,converted_year,converted_month
2,3,Nandani Gupta,30-Jul-22,15:04:24,17:31:07,02:26:42,2022-07-30,30,2022,7
3,4,Hrisikesh Neogi,30-Jul-22,14:34:29,15:19:35,00:45:06,2022-07-30,30,2022,7

In [91]:
df.loc[[1,2]]

KeyError: '[1] not in index'

In [101]:
df.loc[0:3,df.dtypes[df.dtypes=='int64'].index]

   SL No  converted_day  converted_year  converted_month
0      1             30            2022                7
2      3             30            2022                7
3      4             30            2022                7

In [96]:
type(df.dtypes[df.dtypes=='int64'])

pandas.core.series.Series

In [102]:
df2 = df[df.dtypes[df.dtypes=='int64'].index]

In [117]:
df3 = df2[df2<20]

In [109]:
df3

     SL No  converted_day  converted_year  converted_month
0      1.0            NaN             NaN                7
2      3.0            NaN             NaN                7
3      4.0            NaN             NaN                7
4      5.0            NaN             NaN                7
5      6.0            NaN             NaN                7
..     ...            ...             ...              ...
995    NaN            NaN             NaN                7
996    NaN            NaN             NaN                7
997    NaN            NaN             NaN                7
998    NaN            NaN             NaN                7
999    NaN            1.0             NaN                7

[999 rows x 4 columns]

In [110]:
df3.dropna()

Empty DataFrame
Columns: [SL No, converted_day, converted_year, converted_month]
Index: []

In [115]:
df3.dropna(thresh=4)

Empty DataFrame
Columns: [SL No, converted_day, converted_year, converted_month]
Index: []

In [116]:
df3.fillna(value=0)

     SL No  converted_day  converted_year  converted_month
0      1.0            0.0             0.0                7
2      3.0            0.0             0.0                7
3      4.0            0.0             0.0                7
4      5.0            0.0             0.0                7
5      6.0            0.0             0.0                7
..     ...            ...             ...              ...
995    0.0            0.0             0.0                7
996    0.0            0.0             0.0                7
997    0.0            0.0             0.0                7
998    0.0            0.0             0.0                7
999    0.0            1.0             0.0                7

[999 rows x 4 columns]

In [118]:
df3.fillna(value=df3['converted_month'].mean())

     SL No  converted_day  converted_year  converted_month
0      1.0            7.0             7.0                7
2      3.0            7.0             7.0                7
3      4.0            7.0             7.0                7
4      5.0            7.0             7.0                7
5      6.0            7.0             7.0                7
..     ...            ...             ...              ...
995    7.0            7.0             7.0                7
996    7.0            7.0             7.0                7
997    7.0            7.0             7.0                7
998    7.0            7.0             7.0                7
999    7.0            1.0             7.0                7

[999 rows x 4 columns]

In [121]:
df.groupby('Date')['converted_month'].mean()

Date
01-Jul-22    7.0
20-Jul-22    7.0
21-Jul-22    7.0
22-Jul-22    7.0
23-Jul-22    7.0
24-Jul-22    7.0
25-Jul-22    7.0
26-Jul-22    7.0
27-Jul-22    7.0
28-Jul-22    7.0
29-Jul-22    7.0
30-Jul-22    7.0
Name: converted_month, dtype: float64

In [122]:
df.dtypes

SL No                       int64
Agent                      object
Date                       object
Login Time                 object
Logout Time                object
Duration                   object
converted_Date     datetime64[ns]
converted_day               int64
converted_year              int64
converted_month             int64
dtype: object

In [123]:
# df['sales']=df['sales'].str.replace(",","").astype(int)

0       02:04:10
2       02:26:42
3       00:45:06
4       01:08:36
5       01:02:26
         ...
995     05:58:37
996     06:00:43
997     05:27:34
998     05:16:38
999    514:08:20
Name: Duration, Length: 999, dtype: object